<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b257aaaa89aad2f7e8dc1b18d28835d0c483826154f57962b72302276abc85cb","plan_job_ref":"Job .github/workflows/_test-tf.yaml #53 at https://github.com/DND-IT/github-workflows/actions/runs/15365445283","plan_out_hash":"e165c8ea4fb9401ceba494fe25bca8296cdeb1331970ca68ece92806d5538d48","plan_hash":"2fdbbfae05ae7ee289de3d0f1ebbd70a11ff14079378d400409f1e3099d8e4af","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #53](https://github.com/DND-IT/github-workflows/actions/runs/15365445283)